lisp/literate-programming-in-lisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literate programming in lisp dialects</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"/><link rel="stylesheet" href="/css/site.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a class="brand" href="/">Jingtao&nbsp;Xu</a><span class="nav-links"><a href="/about/about.html">About</a><a href="/#services">Work</a><a href="/writing.html">Writing</a><a href="/proof.html">Proof</a><a class="nav-cta" href="/contact.html">Connect</a></span></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Literate programming in lisp dialects</h1>
</header><div id="outline-container-orga1c60c2" class="outline-2">
<h2 id="orga1c60c2">Introduction</h2>
<div class="outline-text-2" id="text-orga1c60c2">
<p>
For a long time, I pursue a convenient way to write my documents while developing my codes.
And the most common way I found is writing specified format comments in my source file directly.
It is not a nature way and is much weaker than most documentation software.
</p>

<p>
So are there a better way to write documents for my codes?
Do I have to write all documents in my source file with just plain text?
</p>

<p>
Then I find Timothy Daly's talk about <a href="https://www.youtube.com/watch?v=Av0PQDVTP4A">literate programming in the large</a> 
and <a href="https://en.wikipedia.org/wiki/Donald_Knuth">Donald Knuth</a>'s article introducing <a href="http://www.literateprogramming.com/knuthweb.pdf">literate programming</a>, they told me not focus on writing codes,
but focus on writing documents, I agreed with their opinion because <a href="https://en.wikipedia.org/wiki/Literate_programming">Literate programming</a> will change
the way of software development, to force us write codes to human instead of writing codes to just meet the
demand of a computer.
</p>

<p>
but I think they rushed too much against popular development, because if we write document file instead of source code
file, then it is harder for us to benefit from most popular but more and more powerful development tools, and we have to
tangle source file from document file time to time in a iterative development, any way, no one like to keep two copies of codes,
one in the document, and the other in a tangled source file.
</p>

<p>
But things may vary in lisp dialects, because lisp is the most flexible language from my view, and if a lisp dialect 
and its development tools can read a document file just like a source file, then we don't have to keep multiple copies
of source codes, and just enjoy the benefit from <a href="https://en.wikipedia.org/wiki/Literate_programming">Literate programming</a>.
</p>
</div>
</div>
<div id="outline-container-org9d547f9" class="outline-2">
<h2 id="org9d547f9">How</h2>
<div class="outline-text-2" id="text-org9d547f9">
<p>
Then I tried to find out the possibility in lisp dialects, the good news is, we can do it easily.
</p>
</div>
<div id="outline-container-org99d1eb9" class="outline-3">
<h3 id="org99d1eb9">Common Lisp</h3>
<div class="outline-text-3" id="text-org99d1eb9">
<p>
The result of the attempt is my Github project: <a href="https://github.com/jingtaozf/literate-lisp">literate-lisp</a>.
</p>

<p>
As the flexibility of common lisp, all I have to do is adding some new reader syntax so common lisp can read org files directly.
</p>

<p>
Now I have developed some internal projects based on <a href="https://github.com/jingtaozf/literate-lisp">literate-lisp</a>, even <a href="https://github.com/jingtaozf/literate-lisp">literate-lisp</a> itself.
</p>
</div>
</div>
<div id="outline-container-orga609361" class="outline-3">
<h3 id="orga609361">Emacs Lisp</h3>
<div class="outline-text-3" id="text-orga609361">
<p>
The result of the attempt is my Github project: <a href="https://github.com/jingtaozf/literate-elisp">literate-elisp</a>.
</p>

<p>
All I have to do is writing a new read function to read source codes in my document file, with a simple syntax.
</p>

<p>
Now I have maintained my emacs configuration file with <a href="https://github.com/jingtaozf/literate-elisp">literate-elisp</a>, and even <a href="https://github.com/jingtaozf/literate-elisp">literate-elisp</a> itself.
</p>
</div>
</div>
<div id="outline-container-org204f690" class="outline-3">
<h3 id="org204f690">Clojure</h3>
<div class="outline-text-3" id="text-org204f690">
<p>
The result of the attempt is my Github project: <a href="https://github.com/jingtaozf/literate-clojure">literate-clojure</a>.
</p>

<p>
This is just an exercise of Clojure development, 
all I have to do is adding some new reader syntax so Clojure can read org files directly, just like it is done in Common Lisp.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><p>Remote · UTC+8 · fluent English / 中文</p><p><a href="mailto:dev@jingtao.net">dev@jingtao.net</a> · <a href="https://cal.com/jingtaoxu">Book a call</a> · <a href="https://github.com/jingtao-net">github.com/jingtao-net</a></p><p class="fineprint">© Jingtao Xu</p></footer>
</div>
</body>
</html>
